"ose[-12028]" = "Internal error has occurred";
"ospsqlite[-13008]" = "Cannot send changes for read-only snapshot \"%s\"";
"bgsync[12405]" = "Resume Pending";
"ose[-12008]" = "%ld bytes for opcode '%c' have not been read";
"bgsync[-12545]" = "Failed to pause sync agent (see the cause)";
"olstd[-10204]" = "Invalid entity: \"%s\"";
"ose[-12051]" = "Invalid file url specified: \"%s\"";
"bgsync[12302]" = "Pause";
"bgsync[12010]" = "Server notification of priority %d has been received for publication \"%s\"";
"osync_res[16110]" = "Publications";
"bgsync[-12525]" = "Invalid type \"%s\" for an event rule";
"ose[-12031]" = "Received unrecognized data";
"olstd[-10101]" = "IO operation was canceled";
"ose[-12047]" = "Invalid priority specified: %d";
"bgsync[12006]" = "Sync of priority %d has started for publications \"%s\"";
"ospsqlite[-13011]" = "An error has occured during the execution of script \"%s\"";
"bgsync[-12505]" = "Network manager error has occured (see the cause)";
"olstd[0]" = "No error";
"osync_res[16106]" = "Network Name";
"ose[-12011]" = "Plugin returned error %ld: %s";
"ose[-12027]" = "Invalid handle was provided";
"ospsqlite[-13007]" = "Snapshot \"%s\", column \"%s\": blob columns are not allowed in primary key";
"bgsync[12404]" = "Paused";
"ose[15003]" = "The client data has been imported.  This concludes the client upgrade.";
"osync_res[16003]" = "Done";
"ose[-12007]" = "Cannot read %ld bytes for opcode '%c', only %ld bytes remain";
"bgsync[-12544]" = "Failed to stop sync agent (see the cause)";
"olstd[-10203]" = "Malformed character escape: \"%s\"";
"bgsync[12301]" = "Stop";
"ose[-12050]" = "Invalid transport direction specified: %d";
"bgsync[-12524]" = "Invalid subtype \"%s\" for a condition rule";
"olstd[-10100]" = "End of input stream reached";
"ose[-12030]" = "Sent encryption id (%lu,%lu+1) does not matched received (%lu,%lu)";
"ose[-12046]" = "Invalid buffer pointer or buffer length specified";
"bgsync[12005]" = "Compose of priority %d has finished for database \"%s\"";
"bgsync[-12504]" = "Failed to evaluate rule \"%s\" for publication \"%s\"";
"ospsqlite[-13010]" = "Invalid index info received for index \"%s\"";
"osync_res[16105]" = "Client Id";
"ose[-12010]" = "Plugin returned invalid flags '%x'";
"ose[-12026]" = "Invalid session handle was provided";
"ospsqlite[-13006]" = "Could not find snapshot with id %ld";
"bgsync[12403]" = "Pause Pending";
"ose[15002]" = "The client databases have been set up.  Please sync again to import the data from the binary file generated during the export stage.  If you would like to specify custom location for this file, please use the File sync options.";
"osync_res[16002]" = "Cancel";
"ose[-12006]" = "Received invalid opcode %d";
"bgsync[-12543]" = "Failed to start sync agent (see the cause)";
"olstd[-10202]" = "Unterminated escape: \"%.*s\"";
"olstd[-10009]" = "Encountered null pointer or handle: %s";
"bgsync[12300]" = "Start";
"bgsync[-12523]" = "Invalid subtype \"%s\" for an event rule";
"bgsync[-12539]" = "Cannot start sync agent because it has been disabled";
"ose[-12045]" = "API or feature \"%s\" is not supported";
"bgsync[12004]" = "Compose of priority %d has started for database \"%s\"";
"bgsync[-12503]" = "Could not load rule \"%s\" for publication \"%s\" (see the cause)";
"osync_res[16104]" = "Process Id";
"bgsync[-12519]" = "Invalid rule subtype: \"%s\"";
"ose[-12025]" = "Invalid encryption transport version specified: %d";
"ospsqlite[-13005]" = "Large column data (> 64K) is not supported";
"bgsync[12402]" = "Running";
"ose[15001]" = "The database data has been exported.  Please proceed with client upgrade.";
"osync_res[16001]" = "OK";
"ose[-12005]" = "Got invalid record DML type %d from the plugin";
"bgsync[-12542]" = "Invalid parameter specified: %d";
"olstd[-10201]" = "Missing string \"%s\" in xml";
"olstd[-10008]" = "Invalid Hex string \"%s\"";
"bgsync[-12522]" = "Invalid date format: \"%s\"";
"bgsync[-12538]" = "Message reader was canceled from another thread";
"ose[-12044]" = "Failed to load plugin library \"%s\" (see the cause)";
"bgsync[12003]" = "Sync agent has been resumed";
"bgsync[12504]" = "Process";
"bgsync[-12502]" = "Apply has failed for database \"%s\" (see the cause)";
"osync_res[16103]" = "Application Name";
"bgsync[-12518]" = "Invalid rule type: \"%s\"";
"ose[-12024]" = "Received opcode '%c' out of sequence";
"olstd[-10303]" = "Cannot use the scheduler because it has been shutdown";
"olstd[-1]" = "Unknown error";
"ospsqlite[-13004]" = "Invalid data in STATE column";
"bgsync[12401]" = "Start Pending";
"ose[15000]" = "N/A (Export Mode)";
"osync_res[16000]" = "Sync Progress";
"ose[-12004]" = "Password is not specified and was not saved for user \"%s\"";
"olstd[-10200]" = "Could not find attribute \"%s\" at tag \"%s\"";
"olstd[-10007]" = "Invalid date string specified: \"%s\"";
"bgsync[-12541]" = "Failed to evaluate rules for database \"%s\" because it is locked by an application";
"bgsync[-12521]" = "Invalid rule subtype \"%s\" for rule type \"%s\"";
"bgsync[-12537]" = "Cannot create message reader because the allowed maximum of %d running readers will be exceeded";
"ose[-12043]" = "Could not find publication id %lu";
"bgsync[12002]" = "Sync agent has been paused";
"bgsync[12503]" = "Receive";
"bgsync[-12501]" = "Sync of priority %d has failed for publications \"%s\" (see the cause)";
"osync_res[16102]" = "Status";
"bgsync[-12517]" = "Could not find platform database";
"ose[-12023]" = "Snapshot with id %ld already exists";
"olstd[-10302]" = "Cannot use the thread pool because it has been shutdown";
"ose[-12039]" = "Internal error has occurred (see the cause)";
"ospsqlite[-13003]" = "Invalid primary key definition received";
"bgsync[12400]" = "Stopped";
"ose[-12003]" = "User is not specified and last user was not recorded";
"ose[-12019]" = "Could not find publication \"%s\"";
"olstd[-10006]" = "Misquoted string: %s";
"bgsync[-12540]" = "No background sync enabled publications were found on the client";
"olstd[-10215]" = "Invalid value \"%s\" for attribute \"%s\" in tag \"%s\"";
"bgsync[-12520]" = "Invalid rule class: \"%s\"";
"bgsync[-12536]" = "Operation \"%s\" cannot be performed because sync agent is not running";
"ose[-12042]" = "User Transport error has occurred (see the cause)";
"bgsync[12001]" = "Sync agent has been stopped";
"bgsync[12502]" = "Send";
"bgsync[-12500]" = "Compose of priority %d has failed for database \"%s\" (see the cause)";
"osync_res[16101]" = "Sync Agent Information";
"bgsync[-12516]" = "The agent cannot accept control command \"%s\" because it is in state \"%s\"";
"ose[-12022]" = "Could not find transaction with id %ld";
"olstd[-10301]" = "Error during connection establishment of external message queue client";
"ose[-12038]" = "Server error has occurred (see the cause)";
"olstd[-10108]" = "Socket error has occured (see the cause)";
"ospsqlite[-13002]" = "Invalid column definition received";
"ose[-12002]" = "Could not find database \"%s\"";
"ose[-12018]" = "Retrieved record with LOB(s) for a plugin not supporting LOBs";
"olstd[-10005]" = "\"%s\" is not supported";
"olstd[-10214]" = "Tag \"%s\" is not recognized";
"bgsync[-12535]" = "Control operation has timed out";
"ose[-12041]" = "Http Transport error has occurred (see the cause)";
"bgsync[12000]" = "Sync agent has been started";
"bgsync[12501]" = "Prepare";
"ospsqlite[-13021]" = "Cannot update or delete from read-only snapshot \"%s\" with no primary key";
"osync_res[16100]" = "Oracle Sync Agent";
"ose[-12021]" = "Could not find snapshot with id %ld";
"olstd[-10300]" = "Message queue \"%s\" is full";
"ose[-12037]" = "Error saving sync configuration (see the cause)";
"olstd[-10107]" = "Socket timed out after %ld ms";
"ospsqlite[-13001]" = "Invalid snapshot data received";
"ose[-12001]" = "Expecting opcode '%c', received '%c'";
"ose[-12017]" = "Could not find plugin with id %ld";
"olstd[-10004]" = "Encountered null pointer or handle";
"olstd[-10213]" = "Can not find child tag \"%s\"";
"bgsync[-12534]" = "Invalid session handle provided";
"olstd[-10209]" = "Tag data is in unexpected format";
"ose[-12040]" = "Need default database in order to create snapshot \"%s\"";
"bgsync[12500]" = "Idle";
"ose[-12056]" = "Server's public key is missing and could not be obtained";
"bgsync[12015]" = "Unknown";
"bgsync[-12514]" = "Cannot stop the agent because %d active connection(s) are present";
"ospsqlite[-13020]" = "Duplicate meta snapshot: \"%s\"";
"ose[-12020]" = "Could not find snapshot \"%s\" in publication \"%s\"";
"ose[-12036]" = "Error loading sync configuration (see the cause)";
"olstd[-10106]" = "Invalid HTTP chunk heading:";
"ospsqlite[-13000]" = "Sqlite database error (see the cause)";
"ose[-12000]" = "Sync was canceled";
"ose[-12016]" = "Invalid transport type specified: %d";
"olstd[-10003]" = "Invalid argument(s) \"%s\" specified for \"%s\"";
"olstd[-10212]" = "Expecting tag \"%s\", got \"%s\"";
"bgsync[-12533]" = "Invalid status to wait for: %d";
"olstd[-10208]" = "Not enough open tags";
"ose[-12055]" = "Background sync is not possible at this time (please complete first sync or setup sync)";
"bgsync[12014]" = "Trace message: %s";
"bgsync[-12513]" = "Invalid server notification received: \"%s\"";
"bgsync[-12529]" = "Cannot start sync agent because another instance is already running";
"osync_res[16114]" = "Error Information";
"olstd[-10105]" = "Invalid HTTP response line: \"%s\"";
"ose[-12035]" = "Unsuccessful http response: \"%s\"";
"ospsqlite[-13015]" = "Sqlite database error, recovery is needed (see the cause)";
"bgsync[-12509]" = "Failed to establish dialup connection (see the cause)";
"ose[-12015]" = "Transport type is user but user transport is not initialized";
"olstd[-10002]" = "Invalid Base64 string: \"%s\"";
"olstd[-10211]" = "Expecting event %s, got %s";
"bgsync[-12532]" = "Invalid string parameter specified: %d";
"olstd[-10207]" = "End of file in tag \"%s\"";
"ose[-12054]" = "Could not find database key for encrypted database \"%s\"";
"bgsync[12013]" = "Evaluated network, name: \"%s\", speed: %ld bps, ping: %ld ms";
"bgsync[-12512]" = "Invalid control command received: %d";
"bgsync[-12528]" = "Found duplicate platform databases: \"%s\" and \"%s\"";
"osync_res[16113]" = "End Time";
"olstd[-10104]" = "Invalid URL specified: \"%s\"";
"ose[-12034]" = "Invalid encryption type specified: %d";
"bgsync[12009]" = "Apply has finished for database \"%s\"";
"bgsync[-12508]" = "Found platform rule \"%s\" in non-platform database \"%s\"";
"ospsqlite[-13014]" = "Invalid snapshot id %ld for snapshot \"%s\"";
"osync_res[16109]" = "Sync Details";
"ose[-12014]" = "Invalid string option specified: %d";
"olstd[-10001]" = "No more tokens in olStringTokenizer";
"olstd[-10210]" = "Unterminated tag";
"bgsync[12407]" = "Defunct";
"bgsync[-12531]" = "Invalid number parameter specified: %d";
"olstd[-10206]" = "Mismatched end tag: \"%s\"";
"bgsync[-12547]" = "Sync agent encountered fatal error or cannot be stopped";
"ose[-12053]" = "Could not find session key while doing receive on a one-way transport";
"bgsync[12304]" = "Hide UI";
"bgsync[12012]" = "No network";
"bgsync[-12511]" = "Control connection to the agent is closed due to an error (see the cause)";
"bgsync[-12527]" = "Query is missing for a SQL rule";
"osync_res[16112]" = "Start Time";
"olstd[-10103]" = "Invalid arguments specified for progress monitor";
"ose[-12033]" = "Invalid HTTP URL specified: \"%s\"";
"ose[-12049]" = "Failed to resume receiving data";
"bgsync[12008]" = "Apply has started for database \"%s\"";
"bgsync[12201]" = "Memory is low (%ld bytes available)";
"bgsync[-12507]" = "Internal error has occured (the cause may have more information)";
"ospsqlite[-13013]" = "Internal error has occured (the cause may have more info)";
"osync_res[16108]" = "Battery Power";
"ose[-12013]" = "Invalid integer option specified: %d";
"ose[-12029]" = "Unexpected termination opcode encountered during receive";
"olstd[-10000]" = "Text in string \"%s\" is not a valid number";
"ospsqlite[-13009]" = "Snapshot with id %ld already exists";
"bgsync[12406]" = "Stop Pending";
"ose[-12009]" = "Plugin API \"%s\" not found in library \"%s\"";
"bgsync[-12530]" = "\"%s\" is not supported";
"olstd[-10205]" = "Unterminated string";
"bgsync[-12546]" = "Failed to resume sync agent (see the cause)";
"ose[-12052]" = "Only SEND or RECEIVE directions are allowed for a one-way transport";
"bgsync[12303]" = "Resume";
"bgsync[12011]" = "Network has changed from \"%s\" to \"%s\"";
"bgsync[-12510]" = "Failed to process server notification of priority %d for publication \"%s\" (see the cause)";
"bgsync[-12526]" = "Invalid type \"%s\" for a condition rule";
"osync_res[16111]" = "Priority";
"olstd[-10102]" = "Transport call is out of sequence";
"ose[-12032]" = "Received erroneous uncompressed data";
"ose[-12048]" = "Failed to resume sending data";
"bgsync[12007]" = "Sync of priority %d has finished for publications \"%s\"";
"bgsync[12200]" = "Battery power is low (%d %%)";
"bgsync[-12506]" = "Power manager error has occured (see the cause)";
"ospsqlite[-13012]" = "Invalid argument(s) is passed to the function";
"osync_res[16107]" = "Network Speed";
"ose[-12012]" = "Invalid sync direction specified: %d";
